#  Python — это интерпретируемый язык программирования. Это означает, что вы как разработчик пишете файлы Python (.py) в текстовом редакторе, а затем помещаете эти файлы в интерпретатор Python для выполнения. Способ запуска файла python выглядит следующим образом в командной строке: C:\Users\Ваше имя>python helloworld.py Где «helloworld.py» — это название вашего файла на Python. Давайте напишем наш первый файл Python под названием helloworld.py, что можно сделать в любом текстовом редакторе.

# helloworld.py


print("Hello, World!")
import sys

print(sys.version)